Revit 2027 API
EnergyDataSettings.AnalyticalGridCellSize Property
 The cell size for the uniform cubical grid used when computing the building envelope. This property is ingnored unless AnalysisType is RoomsOrSpaces and BuildingEnvelopeDeterminationMethod is IdentifyExteriorElements.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AnalyticalGridCellSize { get; set; }
Public Property AnalyticalGridCellSize As Double
	Get
	Set
public:
property double AnalyticalGridCellSize {
	double get ();
	void set (double value);
}
member AnalyticalGridCellSize : float with get, set
Property Value
Double
Remarks
 This is the size of the "cubes" used to divide the building shell bounding box into a uniform cubical 3D grid.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace